//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

//4 -> да
//-3 -> нет
//7 -> нет

int a = -8;

if ((a % 2) == 0)
{
    System.Console.WriteLine("yes");
}
else
{
    System.Console.WriteLine("no");
}